// основной конструктор        (primary constructor)
// тело основного конструктора (primary constructor body) без объ€влени€ может определ€тьс€ в любом пор€дке
// параметры основного конструктора ограничены временем и существуют, пока выполн€етс€ основной конструктор
// нельз€ ссылатьс€ на параметры вне инициализатора автоматически создаваемого свойства и тела основного конструктора



              // primary constructor
struct Pair<T>(T first, T second)
{
†   public T First  { get; };
†   public T Second { get; } = second;


    {   // primary constructor body
†††     if (first == null) throw new ArgumentNullException("first");
†††     First = first; // провер€ет на null + инициализирует свойство First
    }
}


/*
ќпределение конструктора Ч Pair(string first, string second)
Ч объедин€етс€ с объ€влением класса. Ёто указывает, что параметрами
конструктора €вл€ютс€ first и second (каждый из которых имеет тип T).

Ќа эти параметры ссылаютс€ инициализаторы свойств и присваивают
их своим свойствам.

”прощаетс€ определение, неизмен€емость класса и об€зательного
конструктора (инициализатора всех свойств/полей).
*/

